---
kind: property
id: P:Autodesk.Revit.DB.HostedSweep.VerticalFlipped
source: html/3919a432-3aed-5230-b89a-2346d2f769ca.htm
---
# Autodesk.Revit.DB.HostedSweep.VerticalFlipped Property

Retrieve the vertical flip status of the hosted sweep object.

## Syntax (C#)
```csharp
public bool VerticalFlipped { get; }
```